load-tests/public-catalog-load-test.yml
config:
  target: "http://localhost:6060"
  phases:
    - duration: 20
      arrivalRate: 1
      rampTo: 5
      name: warm-up
    - duration: 40
      arrivalRate: 5
      name: steady-state
    - duration: 20
      arrivalRate: 10
      rampTo: 20
      name: spike
  defaults:
    headers:
      Accept: application/json

scenarios:
  - name: browse-public-catalog
    weight: 8
    flow:
      - get:
          url: /api/v1/product/get-product
      - get:
          url: /api/v1/category/get-category
      - get:
          url: /api/v1/product/product-list/1
      - get:
          url: /api/v1/product/product-count

  - name: search-catalog
    weight: 2
    flow:
      - get:
          url: /api/v1/product/search/shoe