load-tests/public-catalog-stress-load-test.yml
# Created By Wen Han Tang With Help From ChatGPT A0340008W
config:
  target: "http://localhost:6060"
  phases:
    - duration: 30
      arrivalRate: 5
      rampTo: 20
      name: ramp-up
    - duration: 60
      arrivalRate: 20
      rampTo: 60
      name: stress-ramp
    - duration: 30
      arrivalRate: 60
      name: peak
  defaults:
    headers:
      Accept: application/json

scenarios:
  - name: stress-browse-catalog
    weight: 7
    flow:
      - get:
          url: /api/v1/product/get-product
          expect:
            - statusCode: 200
      - get:
          url: /api/v1/product/product-list/1
          expect:
            - statusCode: 200
      - get:
          url: /api/v1/product/product-count
          expect:
            - statusCode: 200

  - name: stress-search-catalog
    weight: 3
    flow:
      - get:
          url: /api/v1/product/search/shoe
          expect:
            - statusCode: 200
      - get:
          url: /api/v1/product/search/bag
          expect:
            - statusCode: 200